<?php
/**
 * 错误信息
 * User: Administrator
 * Date: 2017/11/14/014
 * Time: 22:47
 */

namespace Numa\Aodao;


class Error
{
    /**
     * 根据错误编码获取错误信息
     *
     * @param string $code
     * @return mixed|string
     */
    public static function info($code = '')
    {
        $codes = self::errcodes();

        $errmsg = isset($codes[$code]) ? $codes[$code] : "未知错误-" . $code;

        return $errmsg;
    }

    /**
     * 定义错误编码及对应信息
     *
     * @return array
     */
    public static function errcodes()
    {
        return array(
            '10001' => '业务状态正常',
            '10001-2' => '业务状态正常,启用二审流程',
            '10002' => '指定的业务类型不存在',
            '10003' => '指定的业务类型无权限',
            '10021' => '当前用户业务可用业务量不足',
            '10022' => '当前用户信用额度不足',
            '10023' => '当前用户账号金额不足',
            '10024' => '当前用户已禁用',
            '10025' => '当前用户未实名认证',
            '10026' => '当前用户实名认证成功',
            '10031' => '无效的appid',
            '10032' => '无效的appkey',
            '10033' => '无效的timestamp',
            '10034' => '无效的token',
            '10035' => '签名校验失败',
            '10036' => '无效的业务类型ID',
            '10037' => '无效的手机号码',
            '10038' => '任务名称不能为空',
            '10039_1' => '参数错误:模板ID(template_type)与签名内容(inform_con)和模板内容(content)不能同时使用',
            '10039_2' => '参数错误:签名ID(inform_type)与签名内容inform_con和模板内容content 不能同时使用',
            '10039_3' => '参数错误:模板ID(template_type)和签名ID(inform_type)必须同时使用',
            '10039_4' => '参数错误:签名ID(inform_type)模板ID或则签名内容(inform_con)和模板内容(content)必须存在一组',
            '10039_5' => '请使用POST提交',
            '10039_6' => 'sendtime时间戳小于等于系统时间',//仅作为内部调试时返回
            '10039_7' => '当前时间戳下无可查询报告',//仅作为内部调试时返回
            '10039_8' => '参数错误:模板内容(content)不能为空',
            '10041' => '非授权的IP访问',
            '10042' => '无效的手机号',
            '10043' => '无效的短信内容/短信模板未审核',
            '10044' => '无效的短信签名/签名模板未审核',
            '10044_1' => '包含屏蔽词',
            '10045' => '无效的短信任务',
            '10046' => '短信必须包含有签名',
            '10047' => '无效的签名ID',
            '10048' => '无效的模板ID',
            '10049' => '无效的参数',
            '10051' => '任务添加失败,请查网络',
            '10052' => '任务添加失败,请查跨域权限',
            '10053' => '任务添加失败,用户证书异常或未部署',
            '10054' => '任务添加失败,无效的合同号/合同号未认证',
            '10055' => '任务添加失败,业务类型未指定',
            '10056' => '缺少该任务，或任务建立失败',
            '10057' => '任务执行失败，缺少业务规则',
            '10061' => '网络异常,后端接口离线',
            '10062' => '网络异常,请查跨站协议身份',
            '10063' => '网络异常,负载均衡节点超时',
            '10064' => '网络异常,后端数据库节点超时',
            '10065' => '网络异常,CDN节点超时',
            '10071' => '运营商报告未生成',
            '10099' => '非法DDOS攻击源IP已封禁如有误判请联系管理员4009-100-100'
        );
    }
}